Revit 2027 API
ElectricalSystem.SlotIndex Property
 The Slots where the Electrical System is located in its panel.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SlotIndex { get; }
Public ReadOnly Property SlotIndex As String
	Get
public:
property String^ SlotIndex {
	String^ get ();
}
member SlotIndex : string with get
Property Value
String
Remarks
 This property is used to retrieve the slots of the Electrical System. There may be one or more slot in use in which case they will be comma delimited.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace